logs/TP_Req_LowFareSearch.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <air:LowFareSearchReq AuthorizedBy="user" TraceId="mastermind" TargetBranch="P7186508" ReturnUpsellFare="true" xmlns:air="http://www.travelport.com/schema/air_v47_0" xmlns:com="http://www.travelport.com/schema/common_v47_0">
      <com:BillingPointOfSaleInfo OriginApplication="uAPI"/>
      <air:SearchAirLeg>
        <air:SearchOrigin>
          <com:CityOrAirport Code="DAC" PreferCity="true"/>
        </air:SearchOrigin>
        <air:SearchDestination>
          <com:CityOrAirport Code="DXB" PreferCity="true"/>
        </air:SearchDestination>
        <air:SearchDepTime PreferredTime="2023-04-25"/>
      </air:SearchAirLeg>
      <air:AirSearchModifiers MaxJourneyTime="99" MaxSolutions="200">
        <air:PreferredProviders>
          <com:Provider Code="1G"/>
        </air:PreferredProviders>
        <air:PreferredCabins>
          <com:CabinClass Type="Economy"/>
        </air:PreferredCabins>
      </air:AirSearchModifiers>
      <com:SearchPassenger BookingTravelerRef="P_1" Code="ADT" DOB="2000-11-23"/>
      <com:SearchPassenger BookingTravelerRef="P_2" Code="CNN" DOB="2012-11-23"/>
      <air:AirPricingModifiers FaresIndicator="PublicFaresOnly" ETicketability="true"/>
    </air:LowFareSearchReq>
  </soap:Body>
</soap:Envelope>